Show / Hide Table of Contents
Class OpeningCirc
Representation of circular opening in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Opening
OpeningCirc
Inherited Members
 Opening.Name
 Opening.GeomId
 Opening.MasterComponent
 Opening.MasterPoint
 Opening.InsertPoint
 Opening.Outline
 Opening.Position
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Opening))]
public class OpeningCirc : Opening
Constructors
Improve this Doc   View Source
OpeningCirc()
Constructor
Declaration
public OpeningCirc()
Properties
Improve this Doc   View Source
Diameter
Diameter of opening
Declaration
public double Diameter { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source